Load Tests/ToDo Endpoint/Get/getTest.yaml
config:
  target: https://localhost:7204
  payload:
    path: todos.csv
    fields:
      - "id"      
    skipHeader: true 
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 5
      arrivalRate: 10
      rampTo: 30
      name: Spike phase    
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
    - get:
        url: /api/todos/{{id}}